#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.s3_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_acm_certificate.cert will be created
  + resource "aws_acm_certificate" "cert" {
      + arn                       = (known after apply)
      + domain_name               = "sylius-plugin-generator.madcoders.dev"
      + domain_validation_options = [
          + {
              + domain_name           = "sylius-plugin-generator.madcoders.dev"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + tags_all                  = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.cert will be created
  + resource "aws_acm_certificate_validation" "cert" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_cloudfront_distribution.ngapp will be created
  + resource "aws_cloudfront_distribution" "ngapp" {
      + aliases                        = [
          + "sylius-plugin-generator.madcoders.dev",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + comment                        = "Angular application"
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags                           = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + tags_all                       = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = false

      + custom_error_response {
          + error_code         = 403
          + response_code      = 200
          + response_page_path = "/index.html"
        }
      + custom_error_response {
          + error_code         = 404
          + response_code      = 200
          + response_page_path = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 30
          + max_ttl                = 360
          + min_ttl                = 0
          + target_origin_id       = "ngS3Origin"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "ngS3Origin"

          + s3_origin_config {
              + origin_access_identity = (known after apply)
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn            = (known after apply)
          + cloudfront_default_certificate = false
          + minimum_protocol_version       = "TLSv1"
          + ssl_support_method             = "sni-only"
        }
    }

  # aws_cloudfront_origin_access_identity.ngapp will be created
  + resource "aws_cloudfront_origin_access_identity" "ngapp" {
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Sylius plugin skeleton generator - Angular frontend OAI"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_route53_record.cert["sylius-plugin-generator.madcoders.dev"] will be created
  + resource "aws_route53_record" "cert" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z3ADNKTU3QJP19"
    }

  # aws_route53_record.ngapp will be created
  + resource "aws_route53_record" "ngapp" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sylius-plugin-generator.madcoders.dev"
      + type            = "A"
      + zone_id         = "Z3ADNKTU3QJP19"

      + alias {
          + evaluate_target_health = true
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_s3_bucket.ngapp will be created
  + resource "aws_s3_bucket" "ngapp" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "sylius-plugin-skel-gen-ng01-prod"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + tags_all                    = {
          + "customer"  = "Madcoders"
          + "env"       = "prod"
          + "managedBy" = "terraform"
          + "project"   = "sylius-plugin-skeleton-generator"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # aws_s3_bucket_policy.ngapp will be created
  + resource "aws_s3_bucket_policy" "ngapp" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + frontend_bucket_name        = "sylius-plugin-skel-gen-ng01-prod"
  + frontend_bucket_region      = (known after apply)
  + frontend_cf_distribution_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: prod.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "prod.plan"

```

</details>

*Pusher: @plewandowski, Action: `pull_request`, Working Directory: ``, Workflow: `Infrastructure of frontend application`*